<template>
    <section data-sec="section02" class="feature_wrapF second">
        <span class="label_title">Путешествие в достижении жизненной цели</span>
        <div id="fantasyWorld">
            <h2>Мир Эсвас</h2>
        </div>
        <div class="hisoty_wrap">
            <div class="tab_nav_area">
                <ul class="tab_history">
                    <li class=""><a v-on:click="show(1)" id="historyF">История Эсваса</a></li>
                    <li class=""><a v-on:click="show(2)" id="worldviewF">Мировозрения</a></li>
                    <li class=""><a v-on:click="show(3)" id="nationsF">Народы</a></li>
                </ul>
            </div>
            <div class="tab_container" >
                <div class="tab_cont active" id="history">
                    <div class="box_history history_world">
                        <div class="inner">
                            <strong class="title">История Эсваса</strong>
                            <div class="text_area">Основа древней цивилизации - таинственные «Черные камни» - являясь мощным источником энергии, оказали большое влияние на развитие технологий Древних. В то же время, говорят, что Черные камни, затуманив разум Древних своей неестественной активностью, стали причиной падения их цивилизации. Большое количество Черных камней находится в пустыне между Кальфеоном и Валенсией. Кальфеон назвал землю, где сокрыты Черные камни, Черной пустыней и развязал войну с целью захвата ее ресурсов. А в Валенсии эту пустыню называют Красной, так как множество солдатов Валенсии погибло в кровопролитной войне. Раскройте секреты цивилизации Древних, таящиеся в недрах истории!
                            </div>
                        </div>
                    </div>
                </div>

                <div class="tab_cont " id="worldview">
                    <div class="box_history box_calpheon">
                        <div class="inner">
                            <strong class="title">Мировозрения</strong>
                            <div class="text_area">
                                <div class="paragraph">
                                    <strong class="year_title">Кора</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/кора.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владычица крови, безумная жажда к которой не ослепляет ее, но делает сильней. Лишь эта густая красная жидкость дает ей смысл существования и безграничное наслаждение…
                                </div>
                                <div class="paragraph">
                                    <strong class="year_title">Барт</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/барт.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка хаоса и раздора, отрекшийся от остальных владык он ищет разрушений, что питают его дух и укрепляют его ненависть к человеческой расе
                                </div>
                                <div class="paragraph">
                                    <strong class="year_title">Кира</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/кира.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Сестра-близнец Лиры, настроенная на гораздо более радикальные взгляды на любовь. Владычица разврата всегда готова встретить путников и даже дать им насладиться… Расплатой такому наслаждению может стать их собственная жизнь
                                </div>
                                <div class="paragraph">
                                    <strong class="year_title">Тори</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/тори.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка обмана, многоликий бог, чьи намерения не могут выяснить даже другие владыки. В отличии от других владык нижнего круга он не желает полного уничтожения людей, его преследуют гораздо более перспективные планы…
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Орна</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/орна.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка истины и справедливости. Спокойная и лаконичная, она никогда не выделялась особой любовью к людям, но после ухода отца решила, что справедливей будет встать на сторону верховных владык

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Пелиций</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/пелиций.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка, что выбрал своей стихией – знания. Вдохновение Пелиций черпал от людей и их стремления к развитию. Он был частым гостем в мире смертных и никогда не гнушался личного общения с представителями разных рас и национальностей.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Лира</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/лира.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владычица любви и милосердия, добрейшая из двенадцати . Она не редко следит за отношениями между людьми, которые являются ее духовными вдохновителями. Она негативно смотрит на небрежность и жестокость, и, в отличии от ее сестры-близнеца, Лира ставит духовную любовь гораздо выше плотских утех.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Тей</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/тей.png" alt style="
                                         height: 500px;">
                                    </p>
                                    Владыка ремесла и плодородия, нередко он одарял упорно трудящихся своим благословлением. Многие великие люди клянутся, что именно благодаря этому они пришли к успеху в своем деле. Вместе с отцом он вложил в строение текущего мира гораздо больше других своих братьев.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Хильви</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/хильви.png" alt style="
                                         height: 500px;">
                                    </p>
                                    Владычица охоты, старшая из владык. Молчалива, спокойна, хладнокровна. Из отрекшихся она самая  снисходительна к людям, но после ухода отца не приняла ни одну из сторон лишь потому, что решила заняться личными утехами и забавами. Единственная из владык, кто обрадовался уходу отца.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Боорет</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/боорет.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка безумия, никогда не угадаешь чем обернется его очередной приход на землю. Единственное, что можно сказать это то, что он очень любит играть…
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Чин</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/чин.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка войны. Слабым он дарует смерть, а сильных делает великими. Благороден и честен, но напрочь отсутствует снисходительность.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Алия</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/worldview/алия.png" alt style="
                                         width: 500px;">
                                    </p>
                                    Владыка природы, ее так же принято считать богиней удачи. Всегда предстает перед людьми в образе красивой девушки с характером капризного ребенка, в своей непредсказуемости она уступает разве что Боорету, которого считает любимым братом, из-за любви к играм. Алия – младшая из Двенадцати

                                </div>

                            </div>
                        </div>
                    </div>
                </div>

                <div class="tab_cont " id="nations">
                    <div class="box_history box_serendia">
                        <div class="inner">
                            <strong class="title">Народы</strong>
                            <div class="text_area">
                                <div class="paragraph">
                                    <strong class="year_title">Гномы</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/гномы.jpg" alt style="width: 500px">
                                    </p>
                                    Гномы — один из самых низкорослых народов, их рост чуть выше 3 футов
                                    Фут = 0,304 метра. Пять футов ~ 1,5 метра Это единица измерения в англоговорящих странах, а так же используемая в pathfinder для определения дистанции спеллов, оружия и всего остального... More
                                    . Их волосы обычно очень яркого цвета: оранжевые, как осенние листья; зеленые, как листва весной; темно-красные или пурпурные, как распустившиеся цветы. Варьируется и цвет кожи — от коричнево-земляного до цветочно-розового без особой связи с наследственностью. Гномы сильно отличаются друг от друга чертами лица, у ни часто встречаются очень большие глаза или рты, что в одном случае может выглядеть пугающе, а в другом — привлекательно.
                                    <br> <strong>Общество:</strong> В отличие от большинства народов, гномы не имеют четкой общественной структуры. Гномы по природе существа переменчивые и обычно странствуют в одиночку или с временными попутчиками в поисках новых волнующих приключений. У них редко складываются длительные отношения друг с другом или с представителями других народов. Зачастую гномы занимаются работой или коллекционированием с рвением, граничащим с фанатизмом. Мужчины у гномов имеют странное пристрастие к необычным шляпам и другим головным уборам, тогда как женщины гордо демонстрируют сложные и эксцентричные прически.
                                    <br> <strong>Отношения:</strong> Гномы испытывают трудности во взаимодействии с другими народами как на эмоциональном, так и на физическом уровне. Гномий юмор плохо переводится и часто воспринимается посторонними как злобный или абсурдный, ну а сами они воспринимают другие народы как скучных и неуклюжих великанов. Гномы хорошо ладят с полуросликами и людьми, но любят подшутить над дварфами и полуорками, считая их слишком мрачными. Они уважают эльфов, но эльфийская медлительность в принятии решений часто выводит их из себя. Для гномов действие
                                    всегда лучше бездействия, и многие из них носят с собой незавершенные устройства, чтобы было чем развлечься на отдыхе.
                                    <br> <strong>Приключения:</strong> Гномья страсть к путешествиям делает их прирожденными авантюристами. Они часто отправляются в странствия ради новых впечатлений, ведь нет ничего увлекательнее, чем бессчетные опасности, поджидающие искателей приключений. Гномы компенсируют свою физическую слабость талантом к колдовству и бардовскому искусству.
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Люди</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/люди.jpg" alt="">
                                    </p>
                                    Физические характеристики людей столь же разнообразны, как и условия их обитания. От смуглых кочевников южных земель до бледных варваров северных морей люди отличаются разнообразием цвета кожи, типом сложения и чертами лица. В целом чем ближе люди живут к экватору, тем темнее у них кожа.
                                    <br> <strong>Общество:</strong>Человечество складывается из множества различных общественных строев, мироощущений и образов жизни. Хотя история самых старых человеческих государств насчитывает тысячи лет, по сравнению с государствами дварфов или эльфов людское общество выглядит как кипящий котел, в котором распадаются империи и новые королевства поглощают старые. В целом люди славятся своей гибкостью, изобретательностью и амбициозностью.
                                    <br> <strong>Отношения:</strong>Люди плодовиты, и в периоды территориальной экспансии и колонизации их напористость и многочисленность часто ведут к контактам с другими народами. Во многих случаях такие встречи заканчиваются конфликтами и войнами, но люди легко прощают бывших врагов и вступают в союз с народами, которые не пытаются состязаться с ними в жестокости. Гордые до высокомерия, люди могут считать дварфов скаредными пьяницами, эльфов — легкомысленными щеголями, полуросликов — трусливыми воришками, гномов — одержимыми безумцами, а полуэльфов и полуорков — одним сплошным недоразумением. В то же время разнообразие среди самих людей делает их способными воспринимать чужаков такими, какие они есть, без предубеждений.
                                    <br> <strong>Приключения:</strong>Людским народом движут амбиции, и для многих из них приключения — лишь средство для достижения цели, будь то богатство, слава, положение в обществе или тайные знания. Мало кто ввязывается в авантюры, чтобы просто пощекотать себе нервы.
                                    Люди населяют все уголки мира и занимаются всем, чем только возможно, поэтому способны взять на себя любую роль в отряде искателей приключений.
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Орки</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/орки.jpg" alt style="width: 500px;">
                                    </p>
                                    Орки агрессивны, черствы и властны. Воины по натуре, они уважают силу и мощь как высшие добродетели. На почти инстинктивном уровне орки верят, что имеют право на все, что захотят, если кто-то более сильный не сможет помешать им воспользоваться этим. Они редко проявляют себя вне поля битвы, кроме случаев, когда они вынуждены это делать; Такое отношение проистекает не только из лени, но и из укоренившейся веры в то, что работа должна падать на плечи слабых. Они берут рабов из других рас. Мужчины-орки жестоко обращаются с женщинами-орками, с детьми и стариками на том основании, что тот, кто слишком слаб, чтобы дать отпор, заслуживает лишь страдания. Окруженные все время злобными врагами, орки культивируют отношение безразличия к боли, злобному характеру и яростной готовности совершать невыразимые акты мести всем, кто осмеливается бросить им вызов. Мощно сложенные, орки обычно всего на несколько дюймов выше, чем большинство людей, но имеют гораздо большую мышечную массу, широкие плечи и толстые мускулистые бедра, часто дающие им слегка дергающуюся походку. У них обычно тускло-зеленая кожа, грубые темные волосы, красные глаза бусинки и выпуклые, похожие на клыки зубы. Орки считают шрамы отличительной чертой и часто используют их как татуировки. Орки обычно покидают свои племена только после поражения в борьбе за власть. Столкнувшись с унижением или даже рабством, они предпочитают жить и работать с представителями других рас. Орки, которые не могут обуздать свой характер и инстинктивное стремление к доминированию, редко могут нормально влиться в общество. Хотя орки, которым это удается , часто наслаждаются роскошью и комфортом цивилизации,и все же они все еще склонны мечтать о возвращении домой, захвате власти и мести.
                                    <br> <strong>Общество:</strong> Орки обычно живут среди постоянных беспорядков, а запугивание и жестокое насилие — это то, что скрепляет культуру орков. Они разрешают споры, мордобоем, часто такой конфликт перерастет в настоящее кровопролитие. Орки, которые выигрывают эти свирепые драки, не только не стесняются забирать у проигравшего все, что хотят, но также часто оставляют на теле проигравших унизительные увечья. Орки редко проводят много времени, улучшая свои дома или имущество, так как это просто побуждает более сильного орка захватить их. Фактически, когда это возможно, они предпочитают занимать здания и города, изначально построенные другими расами. Отношения с другими расами Орки восхищаются силой превыше всего. Даже члены вражеских рас иногда могут завоевать неохотное уважение орков или, по крайней мере, терпимость, если конечно же во время сломать орку нос. Орки считают дварфов и эльфов странной смесью жестокой ненависти, угрюмой обиды и настороженности. Они уважают власть и, на некотором уровне, понимают, что эти две расы держали их в страхе на протяжении бесчисленных веков. Хотя они никогда не упускают возможности помучить дварфа или эльфа, который попадает в их когти, они склонны действовать осторожно, если не уверены в победе. Орки отвергают полуросликов и гномов как слабаков, едва стоящих за труд порабощения. Они часто считают полуэльфов, которые кажутся менее угрожающими, чем полнокровные эльфы, но имеют много эльфийских черт, как особенно привлекательных рабов. Орки видят в людях расу овец, среди которых живут несколько волков. Они свободно убивают или угнетают людей, слишком слабых, чтобы отбиваться от них, но всегда следят за ближайшим выходом на случай, если они столкнутся с грозным человеком. Орки смотрят на полуорков со странной смесью презрения, зависти и гордости. Хотя эти полукровки слабее, чем типичные орки, они, как правило, умнее, хитрее и харизматичнее. Племена, возглавляемые полуорками, часто более успешны, чем племена, возглавляемые чистокровными орками. На более фундаментальном уровне орки считают, что каждый полуорк также представляет собой орка, оказывающего господство над более слабой расой.
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Темные эльфы</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/темные%20эльфы.jpg" alt style="width: 600px">
                                    </p>
                                    Эльфы обычно выше людей, но обладают более хрупким и изящным сложением и длинными заостренными ушами. У эльфов большие миндалевидные глаза с крупными, ярко окрашенными радужками.
                                    Темные Эльфы были когда то частью Эльфийских племен, но были изгнанны после того, как они стали обучаться черной магии чтобы получить силу для борьбы с Людьми. Они проиграли сражение, но продолжили изучать темные искусства. Темные Эльфы имеют такие же особенности что и их Эльфийские братья, но они высще ростом, имеют сине-серую кожу, и серебряные волосы.
                                    <br> <strong>Общество:</strong> Темные Эльфы отделились от Лесных Эльфов, заключив договор с таинственными Безликими. Тогда весь их народ принял Тьму и стал жить в подземном мире, строя свои города в огромных подземных пещерах. Темные Эльфы поклоняются дракону тьмы и доказывают свою преданность ей поступками в ее честь, поэтому общество Dungeon построено на секретности, интригах, предательстве и оккультизме. Каждым городом управляет свой клан, во главе которого стоит Высшая Жрица. Женщины всемогущи в этом обществе, так как они управляют религиозной, политической и военной силой. Они не воспитывают детей сами: вместо этого их отправляют в храм, где их обучают всем наукам, которые должен знать молодой темный эльф, чтобы выжить в этом мире.
                                    В мирные времена Темные Эльфы используют свои весьма специфические умения против других темноэльфийских городов, чтобы укрепить свой клан. Но во время войны все их навыки будут направлены на убийство, а сила интриг обрушится на общего врага. Как воины, Темные Эльфы известны за свою исключительную силу и проворство, которыми владеют даже их войска низших рангов. К счастью для их врагов, их исключительность стоит весьма дорого, и прирост воинов невелик, поэтому Темные Эльфы немногочисленны, и потеря каждого воина - это серьезный удар по их военной мощи.
                                    <br> <strong>Отношения:</strong>Эльфы склонны считать остальные народы слишком торопливыми и импульсивными, а потому не воспринимают их всерьез, но при этом хорошо разбираются в чужих душах. Эльфу может не нравиться сосед-дварф, но он первым признает кузнечное мастерство этого дварфа. Эльфы считают гномов странными (а порой и опасными) чудаками, а к полуросликам относятся с некоторой жалостью, так как, на эльфийский взгляд, эти малыши живут бродягами, не имея родных земель. Люди эльфов просто очаровывают, что подтверждается большим числом полуэльфов, хотя эльфы обычно не признают таких потомков. К полуоркам эльфы относятся с недоверием и подозрением.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Древние эльфы</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/древние%20эльфы.jpg" alt style="height: 600px">
                                    </p>
                                    Эльфы обычно выше людей, но обладают более хрупким и изящным сложением и длинными заостренными ушами. У эльфов большие миндалевидные глаза с крупными, ярко окрашенными радужками.
                                    Когда древние эльфы приняли друидизм, они объявили вне закона практику тайной магии. Использование её каралось смертью. Однако, многие Высокорожденными выжили во время Разлома. Они страдали от жажды магии и (за 7,300 лет до нашествия Орды через Темный портал) выступали против Малфуриона и друидов.
                                    <br> <strong>Общество:</strong>Истиннных Высших эльфов осталось очень мало. Большинство выбрали путь Кель'таса солнечного скитальца и стали эльфами крови, заключив союз с нагами. Скудное меньшинство - те кто отказался оставлять Свет и надежды на овладение тайной магии. Оставленные на прозвол судьбы почти всеми расами, выжившие Высшие эльфы являются изгоями в эпоху, в которой для них мало что осталось, кроме жизни, полной горя и всеобщего недоверия.
                                    <br> <strong>Отношения:</strong>Эльфы склонны считать остальные народы слишком торопливыми и импульсивными, а потому не воспринимают их всерьез, но при этом хорошо разбираются в чужих душах. Эльфу может не нравиться сосед-дварф, но он первым признает кузнечное мастерство этого дварфа. Эльфы считают гномов странными (а порой и опасными) чудаками, а к полуросликам относятся с некоторой жалостью, так как, на эльфийский взгляд, эти малыши живут бродягами, не имея родных земель. Люди эльфов просто очаровывают, что подтверждается большим числом полуэльфов, хотя эльфы обычно не признают таких потомков. К полуоркам эльфы относятся с недоверием и подозрением.

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Лесные эльфы</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/лесные%20эльфы.png" alt style="height: 600px">
                                    </p>
                                    Эльфы обычно выше людей, но обладают более хрупким и изящным сложением и длинными заостренными ушами. У эльфов большие миндалевидные глаза с крупными, ярко окрашенными радужками.
                                    Дикие и свободные лесные эльфы охраняют свои леса, обстреливая противников с деревьев невидимыми смертоносными стрелами. Дома они строят в идеальной гармонии с окружающим лесов, и неосторожные путники часто не замечают, что вошли во владения эльфов, пока не становится слишком поздно.
                                    <br> <strong>Общество:</strong>Многие эльфы чувствуют свою связь с природой и стремятся жить с ней в гармонии. Большинство, впрочем, считает работу с землей и камнем вульгарной и предпочитает ей изящные искусства, а врожденное терпение помогает им в занятиях волшебством.
                                    <br> <strong>Отношения:</strong>Эльфы склонны считать остальные народы слишком торопливыми и импульсивными, а потому не воспринимают их всерьез, но при этом хорошо разбираются в чужих душах. Эльфу может не нравиться сосед-дварф, но он первым признает кузнечное мастерство этого дварфа. Эльфы считают гномов странными (а порой и опасными) чудаками, а к полуросликам относятся с некоторой жалостью, так как, на эльфийский взгляд, эти малыши живут бродягами, не имея родных земель. Люди эльфов просто очаровывают, что подтверждается большим числом полуэльфов, хотя эльфы обычно не признают таких потомков. К полуоркам эльфы относятся с недоверием и подозрением.
                                    <br> <strong>Приключения:</strong> Многие эльфы отправляются в странствия из желания повидать окружающий мир. Они покидают свои уединенные лесные поселения, чтобы вернуть утраченную магию своего народа или найти затерянные в веках царства, основанные их пращурами тысячелетия назад.
                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Магмары</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/гномы.jpg" alt="">
                                    </p>

                                </div>

                                <div class="paragraph">
                                    <strong class="year_title">Кессийцы</strong>
                                    <p class="img_area">
                                        <img src="/image/Fantazy/nations/гномы.jpg" alt="">
                                    </p>

                                </div>

                            </div>
                        </div>
                    </div>
                </div>

            </div>
        </div>
    </section>
</template>

<script>
    export default {
        name: "Fantasy",

        methods: {
            show: function(shown) {
                switch (shown) {
                    case 1:
                        document.getElementById("history").style.display = "block";
                        document.getElementById("worldview").style.display = "none";
                        document.getElementById("nations").style.display = "none";
                        break;
                    case 2:
                        document.getElementById("history").style.display = "none";
                        document.getElementById("worldview").style.display = "block";
                        document.getElementById("nations").style.display = "none";
                        break;
                    case 3:
                        document.getElementById("history").style.display = "none";
                        document.getElementById("worldview").style.display = "none";
                        document.getElementById("nations").style.display = "block";
                        break;
                }
                return false;
            }
        }
    }

</script>

<style scoped>

</style>