<template>
    <section data-sec="section02" class="feature_wrapW second">
        <span class="label_title">Выжить любой ценой</span>
        <h2>Мир Пустоши</h2>
        <div class="hisoty_wrap">
            <div class="tab_container" >
                <div class="tab_cont active">
                    <div class="box_history history_world">
                        <div class="inner">
                            <div class="text_area">
                                Прошло 275 лет с той поры, когда на земле царил технический прогресс.
                                275 лет... 9900 месяцев... Более ста тысяч дней...
                                Жизнь на земле остановилась, когда массивные железные снаряды, начиненные ураном, ударились о землю в разных точках земного шара.
                                Человечество само оспорило принципы Дарвина, по которым жило столько тысячелетий. В кромешном аду, что воцарился на плодородных землях густонаселенной планеты сильнейших не было.Была лишь глухая тишина, что давила на само сознание... И яркий свет...
                                Что ждет вас на земле, спустя почти три сотни лет? Рассвет новой жизни, начавшей свой путь с чистого листа? Или огромный могильник, затянутый радиоактивной пылью?
                                Рискнете ли вы сделать шаг в неизвестность, чтобы найти ответы?..
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>

</template>

<script>
    export default {
        name: "Wasteland"
    }
</script>

<style scoped>

</style>